'''
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.
'''
a = 3
b = 4.6
c = 'string'
d = True

print(type(a))
print(type(b))
print(type(c))
print(type(d))